Конфигурация/Documents/ПлатежноеПоручениеИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручениеИсходящее</Name>
			<BasedOn>
				<xr:Item>Document.ВыводДенежныхСредств</xr:Item>
				<xr:Item>Document.НачислениеДивидендов</xr:Item>
				<xr:Item>Document.НачислениеЗадолженности</xr:Item>
				<xr:Item>Document.Оплата</xr:Item>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
				<xr:Item>Document.Сделка</xr:Item>
				<xr:Item>Document.СделкаРЕПО</xr:Item>
				<xr:Item>Document.РазмещениеКредитногоИнструмента</xr:Item>
				<xr:Item>Document.Распоряжение</xr:Item>
				<xr:Item>Document.ПереводДенежныхСредств</xr:Item>
				<xr:Item>Document.ПогашениеПаев</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеПлатежногоПоручения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПлатежноеПоручениеИсходящее/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСДокументами.ИспользуетсяВыгрузкаПлатежныхПорученийВКлиентБанк(ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"), ТекущаяДатаСеанса()) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для организации еще не включено формирование платежных поручений",,,, Отказ);	
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();	
	
КонецПроцедуры // ПриСозданииНаСервере

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

КонецПроцедуры // ПриЧтенииНаСервере

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	СтавкаНДСЧислом = РаботаСНалогамиКлиентСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДС);
	Объект.СуммаНДС = Объект.Сумма * СтавкаНДСЧислом / (100 + СтавкаНДСЧислом);
	
	ИзменитьТекстНДСВНазначенииПлатежа();
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречислениеВБюджетПриИзменении(Элемент)
	
	Если Объект.ПеречислениеВБюджет И Элементы.НадписьПеречислениеВБюджет.Заголовок = "Заполнить" Тогда
		ЗаполнитьРеквизитыПеречисленияВБюджетПоУмолчаниюНаСервере();	
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПеречислениеВБюджетНажатие(Элемент)
	
	ПараметрыФормы = СтруктураРеквизитовПлатежа();
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Объект);
		
	ПараметрыФормы.Вставить("КодБК", КБКПоКодуНаСервере());
	
	РеквизитыПлатежаВБюджет = ОткрытьФормуМодально("Документ.ПлатежноеПоручениеИсходящее.Форма.РеквизитыПлатежаВБюджет", ПараметрыФормы, ЭтаФорма);
	
	Если РеквизитыПлатежаВБюджет <> Неопределено Тогда            		
		ЗаполнитьЗначенияСвойств(Объект, РеквизитыПлатежаВБюджет);				
	КонецЕсли;
	
	ЗаполнитьЗаголовокПеречисленияВБюджет(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
	
	ИзменитьТекстНДСВНазначенииПлатежа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ЭлементыДляОткрытия = Новый Массив;
	ЭлементыДляОткрытия.Добавить("ОснованияОснование");
	ЭлементыДляОткрытия.Добавить("ОснованияСчетДоверительногоУправления");	
    
	ТекущиеДанные = Элементы.Основания.ТекущиеДанные;
		
	Если ЭлементыДляОткрытия.Найти(Элемент.ТекущийЭлемент.Имя) <> Неопределено Тогда
		
		ИмяРеквизита = СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "Основания", "");
		Если ЗначениеЗаполнено(ТекущиеДанные[ИмяРеквизита])Тогда 
			ОткрытьЗначение(ТекущиеДанные[ИмяРеквизита]);
	  	КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаЗаполнитьНазначениеПлатежа(Команда)
	
	ЗаполнитьНазначениеПлатежаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодборОснований(Команда)
	
	// Если в таблице оснований есть строки, устанавливаем отбор по виду документа и контрагенту/договору из первой строки
	ПараметрыФормы = Новый Структура("РежимВыбора, МножественныйВыбор", Истина, Истина);
	
	Если Объект.Основания.Количество() > 0 И ЗначениеЗаполнено(Объект.Основания[0].Основание) Тогда
		
		ОснованиеВПервойСтроке = Объект.Основания[0].Основание;		
			
		Если ТипЗнч(ОснованиеВПервойСтроке) = Тип("ДокументСсылка.Оплата") Тогда
			
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеВПервойСтроке, "Контрагент, Договор, РасчетныйСчет, РасчетныйСчетКонтрагента, ВидДвижения, ВидЗадолженности");
			
		ИначеЕсли ТипЗнч(ОснованиеВПервойСтроке) = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
			
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеВПервойСтроке, "Контрагент, Договор, ВидЗадолженности");	
			
		ИначеЕсли ТипЗнч(ОснованиеВПервойСтроке) = Тип("ДокументСсылка.Распоряжение") Тогда
			
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеВПервойСтроке, "Банк, РасчетныйСчет");
			
		ИначеЕсли ТипЗнч(ОснованиеВПервойСтроке) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда
			
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеВПервойСтроке, "ВидОперации, ТипЗадолженности, РасчетныйСчет, РасчетныйСчетПолучатель");
			
		ИначеЕсли ТипЗнч(ОснованиеВПервойСтроке) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда
			
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеВПервойСтроке, "Брокер, МестоХранения, РасчетныйСчет, РасчетныйСчетПолучатель");	
			
		Иначе
			
			РеквизитыОснования = Неопределено;
			
		КонецЕсли; 
		
		РеквизитыОснования.Вставить("Организация", Объект.Организация);
		
		ПараметрыФормы.Вставить("Отбор", РеквизитыОснования);
		ИмяДокументаОснования = РаботаСДокументами.ПолучитьИмя(ОснованиеВПервойСтроке);
			
	Иначе
		
		// Сначала нужно выбрать тип основания
		СписокТиповОснований = ТипыОснованийДокумента();
		ВыбранныйТип = СписокТиповОснований.ВыбратьЭлемент("Выберите тип основания");
		
		Если ВыбранныйТип = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИмяДокументаОснования = ВыбранныйТип;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация", Объект.Организация));
		
	КонецЕсли;
	
	ВыбранныеЗначения = ОткрытьФормуМодально("Документ." + ИмяДокументаОснования + ".ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
	Если ТипЗнч(ВыбранныеЗначения) = Тип("Массив") Тогда
		
		Для Каждого ВыбранноеЗначение Из ВыбранныеЗначения Цикл			
			
			// Контролируем уникальность документов в основаниях
			Если Объект.Основания.НайтиСтроки(Новый Структура("Основание", ВыбранноеЗначение)).Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока 			= Объект.Основания.Добавить();
			НоваяСтрока.Основание 	= ВыбранноеЗначение; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьДополнительныеДанныеОснованийНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	Если Объект.Основания.Количество() = 1 И Не ЗначениеЗаполнено(Объект.Основания[0].Основание) Тогда
		Объект.Основания.Очистить();
	КонецЕсли; 
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
		
	ОбновитьЮрЛицоОрганизацииНаСервере();
	ЗаполнитьДополнительныеДанныеОснованийНаСервере();
	
	ЗаполнитьЗаголовокПеречисленияВБюджет(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы      = Форма.Элементы;
	ДанныеОбъекта = Форма.Объект;
	
	Элементы.СуммаНДС.Видимость = (ДанныеОбъекта.СтавкаНДС <> ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС")
								И ДанныеОбъекта.СтавкаНДС <> ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0"));
								
	Элементы.НадписьПеречислениеВБюджет.Видимость = ДанныеОбъекта.ПеречислениеВБюджет;							
	
	КоличествоОснований = ДанныеОбъекта.Основания.Количество();
	  
	Если КоличествоОснований > 0 Тогда
		
		Элементы.Сумма.ТолькоПросмотр = Истина;
		
		ТипОснования = ТипЗнч(ДанныеОбъекта.Основания[0].Основание); 
	
		ВидимостьЗадолженности = ТипОснования = Тип("ДокументСсылка.НачислениеЗадолженности") 
							Или ТипОснования = Тип("ДокументСсылка.Оплата");
							
		Элементы.ОснованияВидВходящегоДокумента.Видимость	= ВидимостьЗадолженности;
		Элементы.ОснованияВидВходящегоДокумента.Видимость	= ВидимостьЗадолженности;
		Элементы.ОснованияВидВходящегоДокумента.Видимость	= ВидимостьЗадолженности;
		Элементы.ОснованияВидЗадолженности.Видимость 		= ВидимостьЗадолженности;
		
		ВидимостьДанныхВходящегоДокумента = ВидимостьЗадолженности 
									Или ТипОснования = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств");
									
        Элементы.ОснованияНомерВходящегоДокумента.Видимость	= ВидимостьДанныхВходящегоДокумента;
		Элементы.ОснованияДатаВходящегоДокумента.Видимость	= ВидимостьДанныхВходящегоДокумента;
				
	КонецЕсли;
	
	Элементы.СчетДоверительногоУправления.Видимость = КоличествоОснований > 0; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТекстНДСВНазначенииПлатежа()

	ТекстНДС = ?(Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"), 
								"Без НДС", 
								"В т.ч. НДС (" + СокрЛП(РаботаСНалогамиКлиентСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДС)) + "%) " + Формат(Объект.СуммаНДС, "ЧРД=-; ЧГ=0") + " руб.");
	
	СтрНазначениеПлатежа 	= Объект.НазначениеПлатежа;
	ДлинаНазначенияПлатежа 	= СтрДлина(СтрНазначениеПлатежа);
	
	// Текст НДС в конце назначения платежа. Сначала ищем без НДС, т.к. у нас в основном такие
	ПозицияНДС = СтрНайти(СтрНазначениеПлатежа, "Без НДС", НаправлениеПоиска.СКонца, ДлинаНазначенияПлатежа, 1);
	Если ПозицияНДС = 0 Тогда
		ПозицияНДС = СтрНайти(СтрНазначениеПлатежа, "В т.ч. НДС", НаправлениеПоиска.СКонца, ДлинаНазначенияПлатежа, 1);
	КонецЕсли;
		
	Объект.НазначениеПлатежа = ?(ПозицияНДС = 0, СтрНазначениеПлатежа, Лев(СтрНазначениеПлатежа, ПозицияНДС - 1) + ТекстНДС);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПеречисленияВБюджетПоУмолчаниюНаСервере()
	
	ЗаполнитьЗначенияСвойств(Объект, Документы.ПлатежноеПоручениеИсходящее.РеквизитыПеречисленияВБюджетПоУмолчанию());
	
КонецПроцедуры	
  
&НаСервере
Функция КБКПоКодуНаСервере()
	
	Результат = Справочники.КодыБюджетнойКлассификации.Налоги;
	
	Если Не ПустаяСтрока(Объект.КодБК) Тогда 
	
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КодыБюджетнойКлассификации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КодыБюджетнойКлассификации КАК КодыБюджетнойКлассификации
			|ГДЕ
			|	КодыБюджетнойКлассификации.Код = &Код
			|	И НЕ КодыБюджетнойКлассификации.ПометкаУдаления");
		
		Запрос.УстановитьПараметр("Код", Объект.КодБК);
		
		Выборка = Запрос.Выполнить().Выбрать();
			
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;	
		
	Возврат Результат

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗаголовокПеречисленияВБюджет(Форма)
	
	РеквизитыПлатежаВБюджет = СтруктураРеквизитовПлатежа();
	ЗаполнитьЗначенияСвойств(РеквизитыПлатежаВБюджет, Форма.Объект);
	
	НадписьПеречислениеВБюджет = Форма.Элементы.НадписьПеречислениеВБюджет;
	Представление = "Заполнить"; 
			
	МассивПредставления = Новый Массив;
	Для Каждого ЭлементСтруктуры Из РеквизитыПлатежаВБюджет Цикл
		Если Не ПустаяСтрока(ЭлементСтруктуры.Значение) Тогда
			МассивПредставления.Добавить(ЭлементСтруктуры.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивПредставления.Количество() > 0 Тогда
		Представление = СтрСоединить(МассивПредставления, ";");
	КонецЕсли;
		
	НадписьПеречислениеВБюджет.Заголовок = Представление;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураРеквизитовПлатежа()
	
	Возврат Новый Структура("СтатусСоставителя, КодБК, КодОКТМО, ПоказательОснования, ИдентификаторПлатежа, ПоказательПериода, ПоказательДаты, ПоказательНомера");	
	
КонецФункции

&НаСервере
Функция ОбновитьЮрЛицоОрганизацииНаСервере()
	
	 ЮрЛицоОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДополнительныеДанныеОснованийНаСервере()
	
	Документы.ПлатежноеПоручениеИсходящее.ДозаполнитьПлатежноеПоручениеПоОснованиям(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНазначениеПлатежаНаСервере()
	
	Объект.НазначениеПлатежа = Документы.ПлатежноеПоручениеИсходящее.ТекстНазначенияПлатежа(РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипыОснованийДокумента()
	
	Результат = Новый СписокЗначений;
	
	МассивТипов = Метаданные.Документы.ПлатежноеПоручениеИсходящее.ТабличныеЧасти.Основания.Реквизиты.Основание.Тип.Типы();
	Для Каждого ТипДокумента Из МассивТипов Цикл
		
		Документ = Новый(ТипДокумента);
		Результат.Добавить(РаботаСДокументами.ПолучитьИмя(Документ));
		
	КонецЦикла;		
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти
